#include  "EXT.h"

void DisplaySbr()
{
	if (pVIn)
		{
		DispCellB();
		if (FERR) DisplayErrSbr();
		}
	//;未插电源，工作在放电状态
	else
		{
		if (Stauts == 0) return;
		DispCellA();
		if (FERR) DisplayErrSbr();
		else DisplayStauts();
		}
}
//;-----------------------------------------------------------
void DisplayErrSbr()
{
	if (FFlash50)
		{
		pLED1 = 1;
		pLED2 = 1;
		}
}
//;-----------------------------------------------------------
void DispCellA()
{
	if (F32V)
		{
		if (FlashCnt)
			{
			CellLow = 0x55;
			LEDAllOff();
			pHeat = 0;
			}
		return;
		}
	pLED3 = 1;
	if (F38V)
		{
		if (FlashCnt != 0)
			{
			if ((FlashCnt & 0x01) != 0) pLED4 = 1;
			}
		}
}
/*******************************************************************************
;充电状态
;电池电压小于3.8V:pLED4不亮，pLED3闪烁
*******************************************************************************/
void DispCellB()
{
	if (!FVIn)
		{
		pLED3 = 1;
		pLED4 = 1;
		return;
		}

	switch (CellV)
		{
		case 0:
			pLED4 = 0;
			if (FFlash50) pLED3 = 1;
			break;
		/***********************************************************************
		;充电状态
		;电池电压大于3.8V,小于4.1V:pLED3常亮，pLED4闪烁
		***********************************************************************/
		case 1:
			pLED3 = 1;
			if (FFlash50) pLED4 = 1;
			break;
		/***********************************************************************
		;充电状态
		;电池电压大于4.1V:pLED3、pLED4常亮
		***********************************************************************/
		default:
			pLED4 = 1;
		}
}
/*******************************************************************************
;控温状态显示
*******************************************************************************/
void DisplayStauts()
{
	switch (Stauts)
		{
		case 0: 
			break;
		case 1:
			pLED2 = 1;
			break;
		default:
			pLED1 = 1;
		}
}
	
	
